# ### --- Урок 2. Задание №1 --- ###
# ### -------------------------- ###
#
# ### --- Функция is_odd(n) возвращает True если число не четное и False, если четное --- ###
# ### ------------------------------------------------------------------------------- --- ###
#
def is_odd(n):
    return bool(n - ((n >> 1) << 1))


odd_num = 0
even_num = 0
num = input()
for i in num:
    if is_odd(int(i)):
        odd_num += 1
even_num = len(num) - odd_num
print(f'В числе {num} {even_num} четных и {odd_num} не четных числа')
